Tekla.Structures.Internal.TeklaStructuresDatabaseHelper
Helper class to bypass string length limitation for string values.

Tekla.Structures.Internal.TeklaStructuresDatabaseHelper.MAX_DATABASE_NAME_LENGTH
Max db name length

Tekla.Structures.Internal.TeklaStructuresDatabaseHelper.MAX_DATABASE_STRING_LENGTH
Max db string length

Tekla.Structures.Internal.TeklaStructuresDatabaseHelper.GetIndexedAttributeName(System.String,System.Int32)
Formulates a dialog attribute name for string value.
attributeName: The name of the attribute.
index: The index for the attribute name.